app/Controllers/Alunos.php

SELECT *
FROM `alunos`
---
    public function index(){                                                    //mostra todos os alunos
        return view('alunos',[
            'alunos' => $this->alunosModel->findAll()
        ]);

SELECT *
FROM `alunos`
WHERE `alunos`.`id` = '26'
---
    public function show($id){                                                    //mostra um unico aluno
        return view('alunover',[
            'aluno' => $this->alunosModel->find($id)
        ]);

SELECT *
FROM `alunos`
WHERE `alunos`.`id` = '40'
DELETE FROM `alunos`
WHERE `id` IN ('40')
---
    public function delete($id) {                                               //função para deletar aluno por id
        $aluno = $this->alunosModel->find($id);
        $file = 'imagens/'.$aluno['fotopath'];
        if ($this->alunosModel->delete($id)) {                                  //tenta deletar e retorna mensagem de sucesso ou erro

INSERT INTO `alunos` (`nome`, `endereco`, `fotopath`) VALUES ('Leon bugado', 'r nnanekksal 987', '1660456209_d80a7ba6ce2b28b86c8c.jpg')
---
    public function store() {                                                   //salva um novo registro de aluno
        $imagem = $this->request->getFile('fotopath');
        $foto = \Config\Services::image();                                       //inicializando classe de manipulação de imagem
        if ($imagem->isValid())  {                                              //trata e salva a imagem
            $nomeImagem = $imagem->getRandomName();
            $imagem->move('imagens/', $nomeImagem);
            $foto->withFile('imagens/'.$nomeImagem);                            //as 3 proximas linhas cortam a imagem centralizada em 200x200 pixels
            $foto->fit(200, 200, 'center');
            $foto->save('imagens/'.$nomeImagem);
        } else {
            return view('msgok', [
                'msg' => 'Selecione um arquivo válido.',
                'pagina' => base_url('alunocriar'),
            ]);
        }
        $dados = [                                                              //pega os dados vindos do Post
            'nome' => $this->request->getPost('nome'),
            'endereco' => $this->request->getPost('endereco'),
            'fotopath' => $nomeImagem
        ];
        if (($dados['nome']==null) || ($dados['endereco']==null)){              //trata nome ou endereço NULL
            return view('msgok', [
                'msg' => 'É preciso preencher todos campos.',
                'pagina' => base_url('alunocriar'),
            ]);
        }
        if( $this->alunosModel->save($dados) == true ) {                        //tenta inserir e retorna mensagens de sucesso ou de erro

SELECT *
FROM `alunos`
WHERE `alunos`.`id` = '29'
---
    public function edit($id){                                                  //chama a view para editar o aluno
        return view('alunoeditar',[
            'aluno' => $this->alunosModel->find($id)
        ]);

SELECT *
FROM `alunos`
WHERE `alunos`.`id` = '29'
UPDATE `alunos` SET `nome` = 'Cliff Blezinski', `endereco` = 'Rua: Main, 2033, San Diego, CA, EUA', `fotopath` = '1655109399_08b9cd374094c8951b0d.jpg'
WHERE `alunos`.`id` IN ('29')
---
    public function update(){
        $id = $this->request->getPost('id');
        $imagem = $this->request->getFile('fotopath');
        if ($imagem->isValid() && ! $imagem->hasMoved()) {                      //trata a imagem

            $nomeImagem = $imagem->getRandomName();
            $imagem->move('imagens/', $nomeImagem);
            $foto = \Config\Services::image();                                  //as proximas linhas cortam a imagem centralizada em 200x200 pixels
            $foto->withFile('imagens/'.$nomeImagem);
            $foto->fit(200, 200, 'center');
            $foto->save('imagens/'.$nomeImagem);
        } else {
            $nomeImagem = NULL;
        }
        if ($nomeImagem != NULL) {                                              //trata o caso de a imagem não ser alterada
            $data = [
                'nome'     => $this->request->getPost('nome'),
                'endereco' => $this->request->getPost('endereco'),
                'fotopath'     => $nomeImagem
            ];
            $oldimage = $this->alunosModel->find($id)['fotopath'];              //guarda o nome da foto antiga para deletar posteriormente
        } else {
            $data = [
                'nome'     => $this->request->getPost('nome'),
                'endereco' => $this->request->getPost('endereco'),
            ];
        }
        if( $this->alunosModel->update($id, $data)){                            //tenta fazer o update e mostra msg de sucesso ou erro